{  "architectures": [
  "LlamaForCausalLM"
],
  "model_type": "llama",
  "bos_token_id": 1,
  "eos_token_id": 2,
  "hidden_size": 2048,
  "max_position_embeddings": 896,
  "intermediate_size": 5632, 
  "num_attention_heads": 32,
  "num_key_value_heads": 4,
  "num_hidden_layers": 22,
  "hidden_act": "silu",
  "vocab_size": 64793,
  "rms_norm_eps": 1e-06,
  "tie_emb_prj_weight": true,
  "use_cache": true,
  "do_sample": true,
  "max_length": 896 
}